import Link from 'next/link';
import {
  Table,
  TableBody,
  TableCell,
  TableHead,
  TableHeader,
  TableRow,
} from '@/components/ui/table';

export default function PrivacyPolicyPage() {
  return (
    <div className="mx-auto mb-12 mt-8 max-w-4xl">
      <div className="mb-8 flex flex-col items-center justify-between">
        <h1 className="text-4xl font-bold">מדיניות פרטיות</h1>
        <p className="text-md font-medium text-primary">(עדכון אחרון: 14/01/2025)</p>
      </div>
      <div className="flex flex-col items-start gap-4 text-lg">
        <p>
          ברוכים הבאים לאתר האינטרנט{' '}
          <Link href="https://www.alfeizahav.blog" className="text-primary underline">
            https://www.alfeizahav.blog
          </Link>{' '}
          <span className="font-bold">("האתר")</span>. השימוש באתר ובתכנים הכלולים בו כפוף למדיניות
          הפרטיות המפורטת להלן <span className="font-bold">("מדיניות הפרטיות")</span> ולתנאי השימוש.
        </p>
        <p>
          מדיניות זו מפרטת את האופן בו בעלי האתר אוספים ומשתמשים במידע אודות המשתמשים באתר
          <span className="font-bold">("משתמש/ים", "אתה", ו/או "הנך").</span>
        </p>
        <p>
          השימוש בלשון זכר הינו לנוחות בלבד, והאמור להלן חל על כל המינים. האמור במדיניות פרטיות זו
          בלשון יחיד – אף רבים במשמע.
        </p>
        <p>
          איסוף המידע ועיבודו נעשים בהתאם להוראות חוק הגנת הפרטיות, התשמ"א- 1981{' '}
          <span className="font-bold">("חוק הגנת הפרטיות")</span>, תקנות הגנת הפרטיות (אבטחת מידע),
          תשע"ד -2017 ולשאר הדינים החלים על בעלי האתר.
        </p>
        <p>
          שים לב, כי האתר מכיל קישורים לאתרים ושירותים של צדדים שלישיים, אשר אינם כפופים למדיניות
          זו. עליך לעיין במדיניות הפרטיות של אותם צדדים שלישיים לפני שתמסור להם מידע אישי כלשהו.
        </p>
        <p>
          אנא קרא מדיניות זו בעיון וודא כי האמור בה מקובל עליך. אם אינך מסכים למדיניות הפרטיות,{' '}
          <span className="font-bold underline">אינך רשאי לעשות שימוש באתר</span>.
        </p>
        <h3 className="text-2xl font-bold">כללי</h3>
        <ol className="my-2 list-inside list-decimal space-y-4 marker:text-primary">
          <li>
            לא חלה עליך כל חובה שבדין לספק מידע אישי כלשהו בעת השימוש באתר. שיתוף מידע אישי עם בעלי
            האתר תלוי ברצונך והסכמתך. עם זאת, מסירת מידע אישי מסוים עשויה להיות הכרחית לצורך שימוש
            באתר (לדוגמא: לצורך השארת תגובה או כתיבת הודעה בפורום) וככל שתבחר שלא לספק מידע זה, לא
            תוכל לעשות שימוש מלא באתר.
          </li>
          <li>
            השימוש באתר מיועד למשתמשים מעל גיל 18. קטינים מתחת לגיל זה אינם מורשים להשתמש באתר.
            במידה ואינך מעל גיל 18 ו/או אינך בעל כשרות משפטית, הנך נדרש שלא לעשות כל שימוש באתר ושלא
            לספק כל מידע לאתר.
          </li>
          <li>
            בעלי האתר אינם מוכרים מידע אישי אודות המשתמשים באתר לצדדים שלישיים. בעלי האתר מעבירים
            מידע אישי לצדדים שלישיים רק בנסיבות מוגבלות המפורטות להלן.
          </li>
        </ol>
        <h3 className="text-2xl font-bold">המידע הנאסף</h3>
        <p>בעת גלישה ושימוש באתר, בעלי האתר עשויים לאסוף את סוגי המידע הבאים אודות המשתמש:</p>
        <ol className="my-2 list-inside list-decimal space-y-4 marker:text-primary">
          <li>
            מידע שאינו מזהה אישית את המשתמש <span className="font-bold">("מידע שאינו אישי")</span>:
            בעת השימוש באתר, נאספים נתונים אנונימיים, אשר אינם מזהים את המשתמש. מידע זה עשוי לכלול
            את פרטי השימוש המצטברים של המשתמש ומידע אגריגטיבי ו/או טכני המשודר על-ידי מכשירו של
            המשתמש: כתובת IP, דגם מכשיר, מערכת הפעלה ונתונים טכניים אחרים אשר מזהים את המכשיר
            באמצעותו התחברת לשירותים. כמו כן נאסף מידע אנונימי וסטטיסטי בקשר עם השימוש באתר
            ובשירותים, לרבות התנהגות משתמשים באתר, עמודים שנצפו, שיתופים לרשתות חברתיות וכו'. בעלי
            האתר עשויים להסתייע בשירותיהם של צדדים שלישים בהקשר זה, ובכללם Google Analytics. מידע
            מסוג זה לא יזהה אותך באופן אישי. בעלי האתר משתמשים במידע כאמור על מנת להפעיל ולתפעל את
            האתר, לנתח מגמות ודפוסי תנועה, לפלח ולשפר את האתר והתוכן וחווית המשתמש, לצורכי סטטיסטיקה
            ואנליזה פנימית.
          </li>
          <li>
            מידע אשר עשוי לזהות את המשתמש <span className="font-bold">("מידע אישי")</span>: כלומר,
            מידע המאפשר זיהוי של משתמש או עשוי במאמץ סביר לזהות משתמש. מידע אישי זה כולל מזהים
            מקוונים, כמפורט בטבלה מטה.
            <p>הטבלה שלהלן מפרטת את המידע האישי אשר נאסף על ידי בעלי האתר וכן אופן השימוש בו:</p>
            <div className="rounded-md border">
              <Table>
                <TableHeader>
                  <TableRow className="border-b">
                    <TableHead className="border-r p-2">סוג המידע</TableHead>
                    <TableHead className="border-r p-2">אופן השימוש</TableHead>
                  </TableRow>
                </TableHeader>
                <TableBody>
                  <TableRow className="border-b">
                    <TableCell className="border-r p-2">
                      <span className="mb-4 block font-bold">
                        מזהים מקוונים הנאספים בעת הגלישה באתר
                      </span>
                      בעת גלישה באתר, יאספו מזהים מקוונים כגון כתובת פרוטוקול אינטרנט ("IP") וכן
                      מזהים טכניים שונים כמפורט לעיל. המידע עשוי להיאסף מידע זה באופן עצמאי או על
                      ידי נותני שירות מטעם בעלי האתר.
                    </TableCell>
                    <TableCell className="border-r p-2">
                      השימוש במזהים מקוונים נעשה על מנת להפעיל ולתפעל את האתר, לנתח מגמות ודפוסי
                      תנועה, לפלח ולשפר את האתר והתוכן וחווית המשתמש. כמו כן, המידע ישמש לצרכי אבטחת
                      האתר, ובכלל זה איתור ומניעה של וירוסים, שימושים אסורים באתר, הונאות או הפרה
                      אחרת של תנאי השימוש או כל דין.
                    </TableCell>
                  </TableRow>
                  <TableRow className="border-b">
                    <TableCell className="border-r p-2">
                      <span className="mb-4 block font-bold">
                        מידע שנאסף בעת יצירת קשר עם בעלי האתר
                      </span>
                      במידה והמשתמש יבחר לפנות לבעלי האתר, בכל אמצעי קשר (לרבות בדוא"ל) המשתמש יתבקש
                      למסור פרטי יצירת קשר כגון שם מלא, כתובת דוא"ל, ותוכן ההודעה.
                    </TableCell>
                    <TableCell className="border-r p-2">
                      השימוש במידע זה ייעשה לצורך מתן מענה לפניית המשתמש.
                    </TableCell>
                  </TableRow>
                  <TableRow className="border-b">
                    <TableCell className="border-r p-2">
                      <span className="mb-4 block font-bold">מידע שנאסף בעת כתיבת תגובה באתר</span>
                      במידה והמשתמש בחר להגיב באתר, הוא יתבקש למסור פרטים כגון שם, כתובת דוא"ל ותוכן
                      התגובה. במידה שהמשתמש מחובר עם חשבון Google, תמונתו תפורסם לצד התגובה.
                    </TableCell>
                    <TableCell className="border-r p-2">
                      בעלי האתר ישתמשו במידע זה לצורך פרסום תגובתך באתר, וכן לצורכי אבטחה וסינון
                      ספאם.
                    </TableCell>
                  </TableRow>
                  <TableRow className="border-b">
                    <TableCell className="border-r p-2">
                      <span className="mb-4 block font-bold">מידע שנאסף בעת רישום לדיוור</span>
                      במסגרת האתר תוצע למשתמש האפשרות להירשם לקבלת דיוור מהאתר. לצורך רישום, המשתמש
                      יתבקש להזין כתובת דוא"ל.
                    </TableCell>
                    <TableCell className="border-r p-2">
                      הרשמה לדיוור כאמור תיעשה רק על ידי קבלת הסכמת המשתמש, דהיינו, מסירת פרטיו
                      באופן יזום באמצעות הטופס הייעודי באתר. בעלי האתר יעשו שימוש במידע זה על מנת
                      לשלוח למשתמש את הדיוור שבו הביע עניין. משתמש אשר יהיה מעוניין להסיר את עצמו
                      מרשימת הדיוור של האתר יוכל לעשות זאת בפנייה ישירה לבעלי האתר בכתובת:{' '}
                      <a
                        href="mailto:contact@alfeizahav.blog"
                        className="text-primary underline underline-offset-4"
                      >
                        contact@alfeizahav.blog
                      </a>{' '}
                      או באמצעות קישור ל"הסרה" אשר יוצע בהודעת הדוא"ל כאמור.
                    </TableCell>
                  </TableRow>
                </TableBody>
              </Table>
            </div>
          </li>
        </ol>
        <h3 className="text-2xl font-bold">כיצד בעלי האתר אוספים מידע</h3>
        <p>בעלי האתר עשויים לאסוף את המידע לעיל באמצעים הבאים:</p>
        <p>
          א. באופן אוטומטי – באמצעות שימוש בטכנולוגיות כגון "עוגיות" (Cookies) ו/או כלי ניטור אחרים
          מטעם צדדים שלישיים.
        </p>
        <p>
          ב. מידע אשר המשתמש מספק לאתר מרצונו – כגון בעת פנייה לבעלי האתר, בעת כתיבת תגובה או בעת
          רישום לשירותי דיוור.
        </p>
        <h3 className="text-2xl font-bold">שימוש ב"עוגיות" וכלי ניטור</h3>
        <p>
          האתר עושה שימוש בקובצי עוגיות (Cookie) (קובצי טקסט קטנים המאוחסנים בדפדפן של המשתמש)
          וטכנולוגיות דומות אחרות לאיסוף נתונים סטטיסטיים. בכל עת תוכל להגדיר את הדפדפן שלך כדי
          לחסום קבצים אלה, אך חסימה זו עלולה למנוע מאתנו לספק לך את השירותים או חלק מהם. טכנולוגיות
          אלה עוזרות לנו לעקוב אחר האופן שבו משתמשים עושים שימוש בשירותים שלנו, ואוספות מידע סטטיסטי
          מצטבר.
        </p>
        <p>
          במסגרת האתר, בעלי האתר עשויים לעשות שימוש בכלי ניטור כאמור מטעם נותני שירותים שהינם צדדים
          שלישיים ועל כן, מומלץ לעיין במדיניות הפרטיות של צדדים שלישיים אלו, כמפורט בטבלה מטה.
        </p>
        <p className="font-bold">הטבלה שלהלן מפרטת את כלי הניטור אשר נעשה בהם שימוש במסגרת האתר:</p>
        <div className="rounded-md border">
          <Table>
            <TableHeader>
              <TableRow className="border-b">
                <TableHead className="border-r p-2">שם</TableHead>
                <TableHead className="border-r p-2">ספק / שירות</TableHead>
                <TableHead className="border-r p-2">מטרה</TableHead>
              </TableRow>
            </TableHeader>
            <TableBody>
              <TableRow className="border-b">
                <TableCell className="border-r p-2">_ga</TableCell>
                <TableCell className="border-r p-2">Google Analytics</TableCell>
                <TableCell className="border-r p-2">ניתוח סטטיסטי</TableCell>
              </TableRow>
              <TableRow className="border-b">
                <TableCell className="border-r p-2">_gat</TableCell>
                <TableCell className="border-r p-2">Google Analytics</TableCell>
                <TableCell className="border-r p-2">ניתוח סטטיסטי</TableCell>
              </TableRow>
            </TableBody>
          </Table>
        </div>
        <p>
          המשתמש רשאי להפסיק את איסוף המידע באמצעות עוגיות (למעט מידע אשר הינו הכרחי לתפעול האתר
          ואבטחתו) באמצעות שינוי הגדרות הדפדפן. יצוין כי במידה ותבחר לחסום או למחוק עוגיות, ייתכן
          וחלק מהשירותים באתר לא יהיו נגישים ו/או חוויית השימוש שלך באתר עשויה להיות מוגבלת.
        </p>
        <h3 className="text-2xl font-bold">מסירת מידע אישי לצדדים שלישיים</h3>
        <p>
          בעלי האתר עשויים להעביר מידע אישי אודות המשתמש לצדדים שלישיים, וזאת, במקרים המפורטים להלן:
        </p>
        <ol className="my-2 list-inside list-decimal space-y-4 marker:text-primary">
          <li>
            בעלי האתר יהיו רשאים לשתף את המידע אשר נאסף מהמשתמש ו/או ביחס למשתמש על פי חובה או סמכות
            שבדין, בהתאם להוראות רשות מוסמכת או צו שיפוטי וכן בשל מחלוקת, טענה, תביעה, דרישה ו/או
            הליכים משפטיים אשר יתנהלו בין המשתמש ו/או מי מטעמו לבין בעלי האתר ו/או מי מטעמם ו/או
            במקרה בו בעלי האתר יהיו סבורים כי מסירת המידע נחוצה על מנת למנוע נזק חמור לרכושם ו/או
            לגופם של צדדים שלישיים ו/או משתמשים אחרים, או על מנת למנוע פגיעה או נזק אחרים לפי שיקול
            דעתם של בעלי האתר.
          </li>
          <li>
            בעלי האתר יהיו רשאים להעביר את המידע אודות המשתמש על מנת לאכוף את תנאי השימוש וכן על מנת
            לאתר, למנוע או לטפל בכל דרך אחרת באירוע הונאה, אבטחה או בעיה טכנית, אך ורק במידה ובהיקף
            הדרושים.
          </li>
          <li>
            בעלי האתר יהיו רשאים להעביר מידע לספקי האתר ו/או נותני שירות או קבלני משנה אשר מספקים
            שירותים עבור האתר (כגון ספקי שירותי אחסון, דיוור, אבטחה, ניתוח נתונים, שירות ותמיכה
            טכנית וכו') בכפוף להוראות הדין החל והדרישות החלות על בעלי האתר.
          </li>
          <li>
            בעלי האתר יהיו רשאים להעביר מידע אודות משתמש בכפוף להסכמתו. כאשר בעלי האתר משתפים את
            המידע כאמור עם צד שלישי בהסכמת ו/או לבקשת המשתמש, המידע האמור יהא כפוף לנהלי הפרטיות של
            הצד השלישי ובעלי האתר אינם אחראים לכל שימוש אשר יעשה על ידי אותם צדדים שלישיים.
          </li>
          <li>
            בכפוף להוראות הדין, בעלי האתר יהיו רשאים להעביר את כל המידע אודותיך שנצבר אצלה לצד שלישי
            במסגרת העברת או הסבת עסקיהם (כולם או חלקם), ארגון מחדש, מיזוג, מיזמים משותפים ועסקאות
            אחרות בקשר לעסקיה (לרבות במסגרת משא ומתן לעסקאות שכאלו) ולצורך המשך הפעלת האתר על ידי
            הצד השלישי. כל זאת בכפוף להתחייבותו של מקבל המידע להשתמש במידע בהתאם למגבלות שחלות על
            בעלי האתר.
          </li>
        </ol>
        <h3 className="text-2xl font-bold">אבטחת מידע</h3>
        <p>
          בעלי האתר מפעילים מערכות ונהלים מקובלים לאבטחת מידע, אשר נועדו לצמצם את הסיכונים לחדירה
          בלתי-מורשית ולאפשר הגנה על המידע שבעלי האתר אוספים. יחד עם זאת, מערכות ונהלים אלה לא
          מעניקים בטחון מוחלט ובעלי האתר אינם מתחייבים שמערכותיהם יהיו חסינות באופן מוחלט מפני גישה
          בלתי-מורשית למידע המאוחסן בהם.
        </p>
        <h3 className="text-2xl font-bold">זכויות המשתמש</h3>
        <p>
          המשתמש רשאי לעיין במידע אודותיו שמצוי אצל בעלי האתר באמצעות פנייה בכתב לדוא"ל:{' '}
          <a
            href="mailto:contact@alfeizahav.blog"
            className="text-primary underline underline-offset-4"
          >
            contact@alfeizahav.blog
          </a>
          . אם מצאת כי המידע שגוי ו/או בלתי מעודכן, תוכל לבקש את תיקונו או מחיקתו, בכפוף לכך שהדבר
          אינו כרוך בעלויות בלתי סבירות. כמו כן, אם המידע השמור אצל בעלי האתר משמש לצורך פניה אישית
          אל המשתמש, בהתבסס על השתייכות לקבוצת אוכלוסין, שנקבעה על פי איפיון אחד או יותר בהתאם
          להוראות חוק הגנת הפרטיות (הידועה גם כפניית דיוור ישיר), המשתמש זכאי לדרוש בכתב כי המידע
          הרלוונטי ביחס למשתמש יימחק ממאגרי בעלי האתר.
        </p>
        <p>
          בעת פנייה לעדכון ו/או עיון ו/או מחיקת מידע כאמור לעיל, בעלי האתר רשאים לדרוש מהמשתמש פרטים
          מסוימים לצורך זיהוי המשתמש בטרם מענה לפנייה האמורה.
        </p>
        <h3 className="text-2xl font-bold">דיוור שיווקי</h3>
        <p>
          במידה ובחרת להירשם לקבלת דיוור מהאתר, כגון רישום לניוזלטר באתר, נשלח אליך מידע ועדכונים על
          רשומות חדשות באתר. הנך מאשר כי אתה מסכים לקבלת הדיוור הנ"ל באמצעות כתובת הדואר האלקטרוני
          שמסרת לנו לצורך זה. אם אינך מעוניין לקבל את הדיוור כאמור, אזי תוכל בכל עת לבטל את הסכמתך
          בדיוור עצמו ולהסיר את עצמך מרשימת התפוצה באמצעות שליחת דוא"ל לכתובת{' '}
          <a
            href="mailto:contact@alfeizahav.blog"
            className="text-primary underline underline-offset-4"
          >
            contact@alfeizahav.blog
          </a>
          .
        </p>
        <h3 className="text-2xl font-bold">שמירת מידע</h3>
        <p>
          בעלי האתר שומרים מידע אישי לתקופה הנדרשת על מנת להגשים את מטרות השימוש המתוארות במדיניות
          זו, להגן או לעמוד על זכויות וטענות משפטיות, לניתוח ושיפור השירותים ובהתאם לדין החל. נתונים
          לא אישיים ונתונים אנונימיים סטטיסטיים עשויים להישמר ללא הגבלה.
        </p>
        <h3 className="text-2xl font-bold">הדין החל</h3>
        <p>
          על מדיניות פרטיות זו יחולו דיניה של מדינת ישראל וכל מחלוקת תידון בבתי המשפט המוסמכים בתל
          אביב- יפו.
        </p>
        <h3 className="text-2xl font-bold">העברת מידע</h3>
        <p>
          בעלי האתר עשויים לעבד או לאחסן מידע אישי הן בישראל והן במדינות אחרות בעולם. המשתמש מאשר
          בזאת כי ע"י גישה לאתר, המידע שלך עשוי להיות מועבר, מאוחסן ומעובד בשרתי האתר מחוץ למדינת
          ישראל. העברת המידע תעשה בהתאם להוראות הדין החל.
        </p>
        <h3 className="text-2xl font-bold">תיקון ועדכון מדיניות הפרטיות</h3>
        <p>
          בעלי האתר שומרים לעצמם את הזכות לתקן או לשנות מעת לעת את תנאי מדיניות הפרטיות, כולם או
          חלקם, על פי הצורך, בכפוף לשיקול דעתם הבלעדי וללא התחייבות למתן הודעה, מוקדמת ו/או בדיעבד.
          במידה ויבוצעו תיקונים ו/או עדכונים כאמור, אלו ייכנסו לתוקף מיד עם הצגת מדיניות הפרטיות
          המעודכנת באתר, כאשר תאריך העדכון יבוא לידי ביטוי תחת הכותרת "עודכן לאחרונה" בכותרת מדיניות
          הפרטיות. במידה ויבוצעו שינויים אשר, לשיקול דעת בעלי האתר, עשויים להשפיע באופן מהותי על
          זכויותיו של המשתמש, בעלי האתר ינקטו באמצעים סבירים על מנת להתריע על כך באתר ו/או באופן
          אחר.
        </p>
        <h3 className="text-2xl font-bold">פניה לבעלי האתר</h3>
        <p>
          בעלי האתר מכבדים את זכותם של משתמשי האתר ואחרים. לשאלות בנוגע למדיניות זו, אנא פנה בדוא"ל
          לכתובת הבאה{' '}
          <a
            href="mailto:contact@alfeizahav.blog"
            className="text-primary underline underline-offset-4"
          >
            contact@alfeizahav.blog
          </a>
          .
        </p>
      </div>
    </div>
  );
}
